Tekla Open API Reference for Tekla Structures 2025
Component.GetComponentInput Method
 Returns the component input object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ComponentInput GetComponentInput()
Public Function GetComponentInput As ComponentInput
Return Value
Type: ComponentInput
The component input object.
See Also
Reference
Component Class
Tekla.Structures.Model Namespace